Revit 2027 API
FloorType.IsFoundationSlab Property
 Returns whether the element FloorAttributes type is FoundationSlab.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFoundationSlab { get; }
Public ReadOnly Property IsFoundationSlab As Boolean
	Get
public:
property bool IsFoundationSlab {
	bool get ();
}
member IsFoundationSlab : bool with get
Property Value
Boolean
See Also
Reference
FloorType Class
Autodesk.Revit.DB Namespace